using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;


/************************************************************************************/
/// PlagueEngine.TimeControlSystem
/************************************************************************************/
namespace PlagueEngine.TimeControlSystem
{

    /********************************************************************************/
    /// Timer
    /********************************************************************************/
    /// <summary>
    /// Timer pozwala ustawiac alarm po upływie danego czasu gry. Może działa w czasie
    /// względem systemu (gry), bądź względem czasu zegara w kontekście którego został
    /// utworzony.
    /// </summary>
    class Timer
    {

        /****************************************************************************/
        /// Delegates
        /****************************************************************************/
        public delegate void CallbackDelegate(uint id);
        private CallbackDelegate callback;
        /****************************************************************************/

        
        /****************************************************************************/
        /// Fields
        /****************************************************************************/
        private TimeSpan elapsedTime = TimeSpan.Zero;
        private TimeSpan alarm       = TimeSpan.Zero;
        private int      repeat      = 0;
        private bool     wasted      = false;
        private uint     id          = 0;
        private static uint totalID  = 0;
        /****************************************************************************/


        /****************************************************************************/
        /// Constructor
        /****************************************************************************/
        public Timer(TimeSpan alarm, int repeat, CallbackDelegate callback)
        {
            this.id         = ++Timer.totalID;
            this.alarm      = alarm;
            this.repeat     = repeat;
            this.callback   = callback;
        }
        /****************************************************************************/


        /****************************************************************************/
        /// Update
        /****************************************************************************/
        public void Update(TimeSpan deltaTime)
        {
            if(wasted) return;

            elapsedTime += deltaTime;
            if (elapsedTime >= alarm)
            {
                elapsedTime -= alarm;
                if (repeat >  0) --repeat;
                if (repeat == 0) wasted = true;

                callback(id);
            }
        }
        /****************************************************************************/


        /****************************************************************************/
        /// Wasted
        /****************************************************************************/
        public bool Wasted
        {
            get
            {
                return wasted;
            }
        }
        /****************************************************************************/


        /****************************************************************************/
        /// ID
        /****************************************************************************/
        public uint ID
        {
            get
            {
                return id;
            }
        }
        /****************************************************************************/

    }
    /********************************************************************************/

}
/************************************************************************************/